app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @school_classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Math"], ["room_number", 7], ["created_at", "2020-08-23 12:33:38.062799"], ["updated_at", "2020-08-23 12:33:38.062799"]]
---
  def create
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    @school_class.save

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Math"], ["room_number", 747], ["updated_at", "2020-08-23 14:21:00.555159"], ["id", 1]]
---
  def update
    set_school_class
    @school_class.update(school_class_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_school_class
    @school_class = SchoolClass.find(params[:id])