app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT "students".* FROM "students"

  def show
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create

    # @student = Student.new(params(:first_name, :last_name))
    @student = Student.new(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Pippi"], ["last_name", "Longstocking"], ["created_at", "2020-08-23 11:25:18.062005"], ["updated_at", "2020-08-23 11:25:18.062005"]]

  def edit
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
    # MUST specify which student id to update or ALL will get updated
    @student = Student.find(params[:id])

    @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Pippi"], ["last_name", "yay! LongstockingZZZ"], ["updated_at", "2020-08-23 13:27:14.990121"], ["id", 1]]